app/controllers/total_sales_summary_controller.rb

  def show
    @language = Language.all
---
SELECT "languages".* FROM "languages"