app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
      <th class='text-center'>Sku</th>
      <th class='text-center'>Name <br/><input type="text" id="name_search" onkeyup="myFilter('products',1,this.value);"></th>